Repository: bdunogier/repository-forms
Catalog: bundle/Resources/translations/validators.*.xlf
Languages: fr

# ez.content_type.descriptions
source: Content type description cannot exceed 255 characters.
fr: Les descriptions de type de contenu ne peuvent dépasser 255 caractères.

# ez.content_type.identifier.pattern
source: Content type identifier may only contain letters from "a" to "z", numbers and underscores.
fr: Les identifiant de type de contenu ne peuvent contenir que les lettres "a" à "z", des chiffres et des blancs soulignés.

source: ez.content_type.identifier.unique
fr: L'identifiant "%identifier%" existe déjà. Les identifiants de type de contenu doivent être unique.

# ez.content_type.names
source: Content type name cannot be blank and cannot exceed 255 characters.
fr: Les noms de type de contenu ne peuvent pas être vide ni dépasser 255 caractères.

source: ez.field_definition.default_field_value
fr: La valeur par défaut du champ n'est pas valide.

# ez.field_definition.descriptions
source: Field definition description cannot exceed 255 characters.
fr: Les descriptions de définition de champ ne peuvent pas dépasser 255 caractères.

source: ez.field_definition.field_settings
fr: Les paramètres de champ ne sont pas valides.

source: ez.field_definition.identifier.unique
fr: L'identifiant "%identifier%" existe déjà dans le type de contenu.

# ez.field_definition.names
source: Field definition name cannot be blank cannot exceed 255 characters.
fr: Les noms de définition de champ ne peuvent pas être vide ni dépasser 255 caractères.

source: ez.field_definition.validator_configuration
fr: La configuration du validateur n'est pas valide.

source: ez.role.identifier.unique
fr: L'identifiant "%identifier%" existe déjà. L'identifiant de rôle doit être unique.

# ez.section.identifier.format
source: Section identifier may only contain letters from "a" to "z", numbers and underscores.
fr: Les identifiants de section ne peuvent contenir que les lettres "a" à "z", des chiffres et des blancs soulignés.

source: ez.section.identifier.unique
fr: Une section avec cet identifiant existe déjà, merci d'en saisir un différent.
